#!/bin/zsh

##
# Файл .zshenv — первый файл, который zsh загружает для КАЖДОЙ shell-сессии,
# независимо от того, интерактивная она или нет.
# Это включает и неинтерактивные дочерние shell-процессы.
# Поэтому здесь лучше держать как можно меньше кода, чтобы не терять
# производительность.
#

# Примечание: шебанг #!/bin/zsh строго обязателен только для исполняемых
# скриптов, но без него редактор может некорректно подсвечивать синтаксис.

# По умолчанию Zsh ищет dotfiles в $HOME (и находит этот файл), но после
# определения $ZDOTDIR начнет искать их в этой директории.
ZDOTDIR=${XDG_CONFIG_HOME:=~/.config}/zsh
# ${X:=Y} задает значение по умолчанию Y для параметра X, если X не задан или
# пустой. При этом X будет создан и получит это значение.
# Чтобы вернуть значение по умолчанию без присваивания X, используйте ${X:-Y}.
# Как и в других shell, ~ разворачивается в $HOME только в начале значения.

# Не даем /etc/zshrc_Apple_Terminal выполнять лишний код.
export SHELL_SESSIONS_DISABLE=1
